const Terms = () => {
    return (
        <pre className="break-words text-pretty text-sm">
            {`제1장 총칙

제1조 (목적)
  이 약관은 노마드랩 주식회사(이하 “회사”)가 회원 및 파트너(이하 “회원”)에게 제공하는 서비스 이용과 관련하여 회사와 회원 간의 권리와 의무 등 기타 필요한 사항을 규정함으로써, 상호간의 이해관계를 합리적으로 조정하는 것을 목적으로 합니다.

제2조 (용어의 정의)
  이 약관에서 사용하는 용어의 정의는 다음과 같습니다. 이 약관에서 별도로 정하지 아니한 용어는 관계 법령 등에서 정하는 바에 따릅니다. 

 1.“회원”이라 함은 약관에 동의하고, 회원가입 절차를 완료한 자를 의미합니다.
 2.“아이디”라 함은 회원의 식별과 서비스 이용을 위하여 회원이 선정하고 회사가 부여하는 문자, 숫자 또는 특수 문자의 조합을 의미합니다.
 3.“비밀번호”라 함은 회원이 부여 받은 아이디와 일치되는 회원임을 확인하고 회원의 정보 및 권익보호를 위하여 회원 자신이 선정하여 비밀로 관리하는 문자, 숫자 또는 특수문자의 조합을 의미합니다.

제3조 (약관의 명시와 개정)
 1. 회사는 이 약관의 내용을 회원이 쉽게 알 수 있도록 회사의 어플리케이션(한파킹) 및 웹사이트(hmkpk.kr)에 게시하거나 연결화면을 통해 제공하는 방법으로 회원에게 공지합니다.
 2. 회사는 회원이 고객센터를 통해 회사와 이 약관의 내용에 관하여 질의 및 응답을 할 수 있도록 조치를 취합니다.
 3. 회사는 『약관의 규제에 관한 법률』, 『정보통신망이용촉진 및 정보보호에 관한 법률』, 『전자상거래 등에서의 소비자보호에 관한 법률』 등 관계법령을 위배하지 않는 범위에서 이 약관을 개정할 수 있습니다.
 4. 회사가 이 약관을 개정할 경우에는 적용일자 및 개정내용, 개정사유 등을 명시하여 그 적용일자로부터 최소한 7일 이전(회원에게 불리하거나 중대한 사항의 변경은 30일 이전)부터 그 적용일자 경과 후 상당한 기간이 경과 할 때까지 회사의 어플리케이션(한파킹) 및 웹사이트(hmkpk.kr)에 게시하거나 연결화면을 통해 제공하는 방법으로 회원에게 공지합니다.
 5. 회사가 이 약관을 개정할 경우에는 개정 약관 공지 후 개정 약관의 적용에 대한 회원의 동의 여부를 확인합니다. 단, 개정 약관 공지 시 회원이 동의 또는 거부의 의사표시를 하지 않으면 승낙한 것으로 간주 하겠다는 내용도 함께 공지한 경우에는 회원이 약관 시행일까지 거부 의사를 표시하지 않는다면 개정 약관에 동의한 것으로 봅니다.
 6. 회원이 개정 약관의 적용에 동의하지 않는 경우 회사는 해당 회원에 대해 개정 약관의 내용을 적용할 수 없으며, 이 경우 회원 또는 회사는 서비스 이용계약을 해지할 수 있습니다.

제4조 (개별계약)
  회사는 클라이언트와 해당 약관과 별도로 계약을 체결할 수 있으며, 해당 내용이 이 약관과 상충 할 경우에는 개별 계약이 우선하여 적용됩니다.

제2장 서비스 이용계약의 체결

제5조 (회원가입)
 1. 회원이 되려고 하는 자는 약관의 내용에 대하여 동의하고, 회사의 어플리케이션(한파킹) 및 웹사이트(hmkpk.kr)의 회원 가입 페이지에서 제공하는 양식을 작성하여 회원가입 하는 방법으로 이용신청을 하여야 합니다.
 2. 회원이 되려고 하는 자는 회원 가입 시 회사가 요구하는 정보 항목에 대하여 실제 정보를 기재하여야 합니다. 실명 또는 식별정보를 허위로 기재하거나 타인의 명의를 도용한 경우에는 이 약관에 의한 회원의 권리를 주장할 수 없고, 회사는 서비스 이용계약을 취소하거나 해지할 수 있습니다.
 3. 회사는 회원이 되려고 하는 자에게 실명확인 및 본인인증, 기타 필요한 정보를 요구할 수 있으며, 그 절차와 방식은 관련 법령에 따릅니다.
 4. 회원가입은 회원의 이 약관에 대한 동의와 회원의 이용 신청에 대한 회사의 승낙으로 성립합니다. 이 약관에 관한 동의는 회원 가입 당시 이 약관에 동의함을 선택하거나 기타 동의 버튼 또는 서명을 통해 의사표시를 합니다.

제6조 (이용신청의 승낙과 제한)
 1. 회원이 되려는 자가 제5조에서 정하는 바에 따라 정당히 이용신청을 한 경우, 회사는 정당한 이유가 없는 한 이용신청을 승낙합니다.
 2. 회사는 다음 각 호의 어느 하나에 해당하는 이용신청에 대해서는 승낙하지 않을 수 있습니다. 
  가. 제5조에 위반하여 이용신청을 한 경우
  나. 자신의 책임 있는 사유에 의한 이용 제한 기록이 있는 자가 이용신청을 하는 경우
  다. 법령에서 금지하는 위법행위를 할 목적으로 이용신청을 하는 경우
  라. 회사의 이익을 저해하려는 목적으로 신청하는 경우
  마. 이전에 회원의 자격을 상실한 적이 있는 자로서 회사의 회원 재가입 승낙을 얻지 못한 경우 
  바. 위 각호에 준하는 사유로서 승낙이 부적절하다고 판단되는 경우
 3. 회사는 서비스 관련 설비의 여유가 없거나, 기술상 또는 업무상 문제가 있는 경우, 서비스 상의 장애가 발생한 경우 및 이에 준하는 사유로 이용신청의 승낙이 곤란한 경우에는 그 사유가 해소될 때까지 승낙을 유보할 수 있습니다.
 4. 회원이 한 제5조의 이용신청에 대하여 회사가 승낙한 경우 회원이 이 약관 및 관련 법령을 위반하지 않은 이상 회원과 회사 간에 유효하게 서비스 이용계약이 체결된 것으로 봅니다.

제7조 (회원 계정정보)
 1. 회사는 회원에 대하여 회원의 정보 보호, 서비스 이용안내 등의 편의를 위해 회원이 선정한 일정한 문자, 숫자 또는 특수문자의 조합을 아이디(ID)로 부여합니다.
 2. 회사는 계정정보를 통하여 당해 회원의 서비스 이용가능 여부 등의 제반 회원 관리 업무를 수행합니다.
 3. 회원의 계정정보에 관한 관리책임은 회원에게 있으며, 이를 제3자가 이용하도록 하여서는 안 됩니다. 회원이 본인의 계정정보를 소홀히 관리하거나 제3자에게 이용을 승낙함으로써 발생하는 손해에 대하여는 회원에게 책임이 있습니다.
 4. 회원은 계정정보가 도용되거나 제3자가 사용하고 있음을 인지한 경우에는 이를 즉시 회사에 통지하고 회사의 안내에 따라야 합니다.
 5. 제4항의 경우에 해당 회원이 회사에 그 사실을 통지하지 않거나, 통지한 경우에도 회사의 안내에 따르지 않아 발생한 불이익에 대하여 회사는 책임지지 않습니다.
 6. 회원은 정기적으로 비밀번호를 변경 가능 하며, 회사는 회원이 원하는 경우 언제든지 비밀번호를 변경할 수 있도록 합니다.

제8조 (회원 정보의 제공 및 변경)
 1. 회원은 이 약관에 의하여 회사에 정보를 제공하여야 하는 경우에는 진실된 정보를 제공하여야 하며, 허위정보 제공으로 인해 발생한 불이익에 대해서는 보호받지 못합니다.
 2. 회원은 개인정보관리화면을 통하여 언제든지 본인의 개인정보를 열람하고 수정할 수 있습니다. 다만, 서비스 관리를 위해 필요한 실명, 아이디(ID) 등은 수정이 불가능합니다.
 3. 회사는 다음과 같은 경우 회원의 아이디(ID)을 변경할 수 있으며, 회사는 이를 제36조에 따라 회원에게 통지합니다. 
  가. 회사가 회원에게 보다 많은 서비스를 효율적으로 제공하기 위해 부득이한 경우
  나. 회사의 서비스 운영이나 운영정책상 다른 서비스와의 통합이 필요한 경우
  다. 기타 회원이 신청한 아이디(ID)이 관계법령 또는 회사의 운영 정책에 따라 상당한 변경 이유가 있는 경우
 4. 회원은 회원가입 신청 시 기재한 사항이 변경되었을 경우 온라인으로 수정 하거나 기타 방법으로 회사에 대하여 그 변경사항을 알려야 합니다.
 5. 제4항의 변경사항을 회사에 알리지 않아 발생한 불이익에 대하여 회사는 책임지지 않습니다.

제9조 (개인정보의 보호 및 관리)
 1. 회사는 『정보통신망 이용촉진 및 정보보호 등에 관한 법률』 등 관계 법령이 정하는 바에 따라 회원의 개인정보를 보호하기 위해 노력합니다. 회원 개인정보의 보호 및 사용에 대해서는 관계법령 및 회사의 개인정보처리방침이 적용됩니다.
 2. 회사의 공식 어플리케이션(한파킹) 및 웹사이트(hmkpk.kr) 이외의 단순히 링크된 제3자의 웹사이트 및 서비스에서는 회사의 개인정보처리방침이 적용되지 않습니다.
 3. 회사는 회원의 귀책사유로 인하여 노출된 회원의 계정정보를 포함한 모든 정보에 대해서 일체의 책임을 지지 않습니다.
 4. 회사는 회사의 서비스를 확장 내지 추가 하는 경우, 회원의 개인정보 및 데이터를 이전할 수 있고, 이전한 개인정보 및 데이터를 이용할 수 있습니다.

제3장 계약당사자의 의무

제10조 (회사의 의무)
 1. 회사는 관계법령과 이 약관이 금지하거나 미풍양속에 반하는 행위를 하지 않으며, 계속적이고 안정적으로 서비스를 제공하기 위하여 최선을 다하여 노력합니다.
 2. 회사는 회원이 안전하게 서비스를 이용할 수 있도록 개인정보(신용정보 포함)보호를 위해 보안시스템을 갖추어야 하며, 개인정보처리방침을 공시하고 준수합니다. 회사는 이 약관 및 개인정보처리방침에서 정한 경우를 제외하고는 회원의 개인정보가 제3자에게 공개 또는 제공되지 않도록 합니다.
 3. 회사는 회원의 서비스 이용과 관련하여 회원으로부터 제기된 의견이나 불만이 정당하다고 인정할 경우에는 이를 처리하여야 합니다. 회원이 제기한 의견이나 불만사항에 대해서는 게시판을 활용하거나 SMS, SNS, 메신저 등을 통하여 회원에게 처리과정 및 결과를 전달합니다.
 4. 회사는 계속적이고 안정적인 서비스의 제공을 위하여 서비스 개선을 하던 중 설비에 장애가 생기거나 데이터 등이 멸실 된 때에는 천재지변, 비상사태, 현재의 기술로는 해결이 불가능한 결함 및 장애 등 부득이한 사유가 없는 한 지체 없이 이를 수리 또는 복구하도록 최선의 노력을 다합니다. 다만, 협력사의 설비에 장애가 생기거나 협력사의 고의 또는 과실로 인하여 데이터 등이 멸실 된 때에는 회사에 고의 또는 중과실이 없는 한 회사는 면책됩니다.
 5. 회사가 제공하는 서비스로 인하여 회원에게 손해가 발생한 경우 그러한 손해가 회사의 고의나 과실에 의해 발생한 경우에 한하여 책임을 부담하며, 그 책임의 범위는 통상손해에 한합니다.

제11조 (회원의 의무)
 1. 회원은 다음 행위(또는 이에 준하는 행위를 포함함)를 하여서는 안 됩니다. 
  (1) 비정상적인 시스템 접근
   • 악성코드, 바이러스 등의 프로그램을 고의 또는 과실로 설치, 유포하는 행위 
   • 회원의 정보를 수집하기 위해 크롤링(crawling)을 하는 행위 
   • 리버스 엔지니어링(reverse engineering), 디컴파일(decompile), 디스어셈블(disassemble) 및 기타 일체의 가공행위를 통하여 서비스를 복제, 분해 또는 모방 기타 변형하는 행위
  (2) 비정상적인 서비스 이용 
   • 허위 또는 타인의 정보로 가입을 하는 행위
   • 정당한 사유 없이 다수의 계정으로 활동을 하는 행위 
   • 계정 내 불리한 정보를 삭제하기 위해 의도적으로 계정을 탈퇴/재가입하는 행위 
   • 정당하지 않은 경제 상의 이익을 취하거나 이 과정에서 명의를 무단으로 사용하는 편법과 불법 행위
  (3) 허위 또는 과장된 정보 입력하는 행위 
   • 회사의 서비스 이용 시 회원이 입력하는 정보 일체에 대하여 허위 또는 과장된 정보를 입력하는 행위 
  (4) 공공질서 위반 
   • 성별, 정치, 종교, 장애, 연령, 사회적 신분, 인종, 지역, 직업 등을 차별하거나 이에 대한 편견을 조장하는 행위 
   • 회사 또는 다른 회원, 제3자를 차별 또는 비방하거나 명예를 훼손하는 행위 
   • 회사 또는 다른 회원, 제3자에게 욕설, 폭언, 협박을 하는 행위
   • 과도한 신체 노출이나 음란한 행위를 묘사하거나, 성매매 관련 정보를 공유하거나, 타인에게 성적 수치심이나 불쾌감을 유발할 수 있는 내용을 게시하는 등 미풍양속에 반하는 정보를 회사의 어플리케이션(한파킹) 및 웹사이트(hmkpk.kr)에 등록하는 행위 
   • 혐오스러운 사진 또는 내용을 게시하거나, 욕설, 비속어, 은어를 사용하는 등 사회 통념에 반하는 비정상적인 활동을 하는 행위 
  (8) 타인의 권리 침해 
   • 회사 및 다른 회원, 제3자의 특허권, 상표권, 저작권 등 지적재산권을 침해하는 행위 또는 침해할 우려가 있는 행위 
   • 타인의 개인정보를 침해하는 행위 
   • 기타 웹 해킹 프로그램, 매크로 프로그램, 보이스 피싱을 위한 미러링 사이트 등 타인의 권리를 침해하거나 침해할 우려가 있는 모든 행위 
  (9) 계정 거래, 양도, 대리, 교환 등
   • 계정 및 계정 내 컨텐츠를 타인에게 판매, 양도, 대여하거나, 타인에게 그 이용을 허락 또는 이를 시도하는 행위 및 이를 알선하는 행위 
  (10) 명의 사칭, 도용 등
   • 다른 회원, 제3자 또는 회사의 직원을 사칭하는 행위 
  (11) 기타 
   • 본 조에 준하는 행위로서 회사의 이익(영업)을 저해하는 행위 
   • 회사의 동의 없이 영리, 영업, 광고, 정치활동 등을 목적으로 서비스를 사용하는 행위
   • 자기 또는 타인에게 재산상의 이익을 주거나 타인에게 손해를 가할 목적으로 허위의 정보를 유통시키는 행위 
   • 관련 법령에서 금지하거나 선량한 풍속 기타 사회통념상 허용되지 아니하거나 원활한 서비스 제공에 악영향을 끼치는 행위
 2. 회원은 이 약관의 규정, 이용안내 및 서비스와 관련하여 공지한 주의사항, 회사가 통지하는 사항 등을 확인하고 준수할 의무가 있습니다.

제12조 (회원의 의무 위반에 대한 제재)
 1. 회원이 제11조의 의무를 위반한 경우에 회사는 사안의 중요성과 다른 회원, 제3자, 회사가 입은 손해를 고려하여 회원에게 다음과 같은 제재를 할 수 있습니다. 
  (1) 서면경고 
   회사는 제11조의 의무를 위반한 회원에게 의무 위반의 내용, 위반 시기 등을 기재하여 서면으로 경고할 수 있습니다. 
  (2) 이용의 제한 
   회사는 일정한 기간을 정하여 등록 및 로그인 등을 제한할 수 있습니다. 
  (3) 영구 정지 
   회사는 회원의 계정을 영구적으로 정지할 수 있습니다.
 2. 회사는 제11조의 의무를 위반하여 제재 대상이 된 회원들에게 제재 내용을 고지합니다.

제4장 서비스 이용

제13조 (서비스의 제공 및 중단 등)
 1. 회사는 회원의 서비스 이용 신청을 승낙한 때부터 서비스를 개시합니다. 단 회사가 필요한 경우 일부 서비스는 특정 시점부터 개시할 수 있습니다. 이러한 경우 회사는 사전 또는 사후에 이를 공지합니다. 회원으로 가입한 이후라도 일부 서비스는 회사가 필요한 경우 특정 회원에게만 서비스를 제공할 수 있습니다. 회사는 서비스를 일정 범위로 분할하여 각 범위 별로 이용 가능 시간을 별도로 정할 수 있습니다. 이 경우 그 내용을 사전 또는 사후에 이를 어플리케이션(한파킹) 및 웹사이트(hmkpk.kr)에 공시하거나 회원에게 이를 통지합니다.
 2. 서비스는 연중무휴, 1일 24시간을 원칙으로 합니다. 다만 서비스 성격에 따라 토요일, 일요일, 공휴일과 평일 오후 6시 이후에는 제공이 제한될 수 있습니다.
 3. 제2항에도 불구하고, 다음 각 호의 어느 하나에 해당하는 경우에는 일정한 시간 동안 서비스가 제공되지 아니할 수 있으며, 해당 시간 동안 회사는 서비스를 제공할 의무가 없습니다. 
  (1) 컴퓨터 등 정보통신설비의 보수점검, 교체, 정기점검 또는 서비스의 수정을 위하여 필요한 경우
  (2) 해킹 등의 전자적 침해사고, 통신 사고, 회원들의 비정상적인 서비스 이용행태, 예상할 수 없는 서비스의 불안정성에 대응하기 위해 필요한 경우 
  (3) 관련 법령에서 특정 시간 또는 방법으로 서비스 제공을 금지하는 경우 
  (4) 천재지변, 국가비상사태, 정전, 서비스 설비의 장애 또는 서비스 이용의 폭주 등으로 정상적인 서비스 제공이 불가능할 경우 
  (5) 분할, 합병, 영업양도, 영업의 폐지, 당해 서비스의 수익 악화 등 회사의 경영상 중대한 필요에 의한 경우
 4. 회사는 제3항 각호의 경우, 7일 전에 그 사실을 회원에게 개별 서비스 초기 화면이나 회사의 어플리케이션(한파킹) 및 웹사이트(hmkpk.kr)에 사전 고지하며, 이 기간 동안 회원이 고지 내용을 인지하지 못한데 대하여 회사는 책임을 부담하지 아니합니다. 사전에 통지할 수 없는 부득이한 사정(긴급한 시스템 점검ᆞ 증설ᆞ교체, 시스템 관리자의 고의, 과실 없는 디스크 장애ᆞ시스템 다운, 제3자인 PC통신 회사, 기간통신사업자 등의 사정으로 인한 서비스 제공의 불가 등 회사가 통제할 수 없는 사정)이 있는 경우에는 그 사정이 종료된 후에 즉시 사후에 통지를 할 수 있습니다.
 5. 또한 위 서비스 중지에 의하여 본 서비스에 보관되거나 전송된 메시지 및 기타 통신 메시지 등의 내용이 보관되지 못하였거나 삭제, 미전송, 기타 통신 데이터의 손실이 발생할 수 있으므로 회원은 중요한 메시지 등을 별도로 보관하고 서비스 중지 기간 이후 메시지 등의 전송 여부를 확인하여야 합니다. 회사의 고의 또는 과실이 없는 한 회사는 이에 대하여 책임을 부담하지 않습니다. 회사의 사정으로 서비스를 영구적으로 중단하여야 할 경우에 제4항을 준용합니다. 다만 이 경우에는 사전 고지 기간을 1개월로 합니다.

제14조 (서비스의 변경 및 내용수정)
 1. 회원은 회사가 제공하는 서비스를 이 약관 및 회사가 설정한 규칙에 따라 이용할 수 있습니다.
 2. 회사는 회사가 창조한 서비스 내용의 제작, 변경, 유지, 보수에 관한 포괄적인 권한을 가지며, 서비스의 질서 유지를 위하여 필요한 조치를 취합니다.
 3. 회사는 분할, 합병, 영업양도, 당해 서비스의 수익 악화, 기술상ㆍ운영상의 필요 등 상당한 이유가 있는 경우, 제공하고 있는 전부 또는 일부 서비스를 변경할 수 있으며, 변경 전 7일 이상 회사의 어플리케이션(한파킹) 및 웹사이트(hmkpk.kr) 등을 통하여 사전 공지합니다. 다만, 사전에 공지할 수 없는 부득이한 사정이 있는 경우 사후에 공지할 수 있습니다.
 4. 회사는 무료로 제공되는 서비스의 일부 또는 전부를 회사의 운영정책 및 운영상의 필요에 따라 수정, 중단, 변경할 수 있으며, 이에 대하여 관계법령에 특별한 규정이 없는 한 회원에게 별도의 보상을 하지 않습니다.

제15조 (정보의 제공 및 광고의 게재)
 1. 회사는 회원의 편의를 위하여 회원이 서비스 이용 중 필요하다고 인정되는 다양한 정보 및 광고를 배너 게재, 전화, 어플리케이션 알림 등의 방법으로 회원에게 제공할 수 있습니다. 회원은 이를 원하지 않을 경우에 회사가 제공하는 방법에 따라 수신을 거부할 수 있습니다.
 2. 전항 단서에 따른 수신 거부 회원의 경우라도 이용약관, 개인정보보호정책, 기타 회원의 이익에 영향을 미칠 수 있는 중요한 사항의 변경 등 회원이 반드시 알고 있어야 하는 사항에 대해서는 전항의 방법으로 정보의 제공 등을 할 수 있습니다.
 3. 회사의 어플리케이션(한파킹) 및 웹사이트(hmkpk.kr)에는 배너와 링크(Link) 등 다양한 형태의 광고가 포함될 수 있으며, 이는 제3자가 제공하는 페이지와 연결될 수 있습니다.
 4. 제3항에 따라 제3자가 제공하는 페이지로 연결될 경우 해당 페이지는 회사의 서비스 영역이 아니므로 회사가 신뢰성, 안정성 등을 보장하지 않으며 그로 인한 회원의 손해에 대하여도 회사는 책임을 지지 않습니다.
 5. 회사는 서비스 상에 게재되어 있거나 서비스를 통한 제3자와의 판촉활동에 회원이 참여하거나 교신 또는 거래의 결과로서 발생하는 모든 손실 또는 손해에 대해 관련 법에 특별한 규정이 있거나 회사의 고의 또는 중과실로 인한 경우가 아닌 한 책임을 지지 않습니다.

제16조 (게시물의 관리)
 1. 회원이 등록한 미션을 회사는 회사의 어플리케이션(한파킹) 및 웹사이트(hmkpk.kr) 내에 이를 게시(변형, 가공, 요약, 발췌, 취합 행위를 포함)할 수 있는 권리를 갖습니다. 회사는 다음 각 호에 해당하는 이동 또는 등록 거부의 조치를 취할 수 있습니다. 
  (1) 서비스 이용 목적에 부합하지 않는 경우 
  (2) 일치하거나 유사한 내용이 있어 중복되는 경우 
  (3) 이 약관에 위배되거나 상용 또는 불법, 음란, 저속하다고 판단되는 내용인 경우 
  (4) 다른 회원 또는 제3자를 비방하거나 중상모략으로 명예를 손상시키는 내용인 경우 
  (5) 공공질서 및 미풍양속에 위반되는 내용인 경우 
  (6) 범죄적 행위에 결부된다고 인정되는 내용일 경우 
  (7) 제3자의 초상권, 저작권 등 기타 권리를 침해하는 내용인 경우 
  (8) 서비스 성격에 부합하지 않는 정보의 경우 
  (9) 기타 관계 법령에 위배 되는 경우
 2. 회사는 타인의 저작권을 침해하는 게시물에 대하여 저작권법에 정해진 절차에 의하여 저작권자 또는 회원의 요청에 의해 해당 게시물을 삭제하거나 다시 등록할 수 있으며, 이 경우 회사는 면책됩니다. 회원의 게시물이 타인의 저작권을 침해함으로써 발생하는 민, 형사상의 책임은 전적으로 회원이 부담하여야 합니다.
 3. 회원은 서비스를 이용하여 얻은 정보를 가공, 판매하는 행위 등 어플리케이션(한파킹) 및 웹사이트(hmkpk.kr)에 등록된 게시물이나 스토어를 상업적으로 사용할 수 없습니다.
 4. 회사가 제공하는 서비스, 그에 필요한 소프트웨어, 이미지, 마크, 로고, 디자인, 서비스 명칭, 정보 및 상표 등과 관련된 지적재산권 및 기타 권리는 회사에게 있습니다. 회원은 회사가 명시적으로 승인한 경우를 제외하고는 상기 항에 기재한 소정의 각 재산에 대한 전부 또는 일부의 수정, 대여, 대출, 판매, 배포, 제작, 양도, 재라이센스, 담보권설정행위, 상업적 이용행위를 할 수 없으며, 제3자로 하여금 이와 같은 행위를 하도록 허락할 수 없습니다.

제17조 (저작권 등의 귀속)
 1. 회사가 제작한 콘텐츠에 대한 저작권 및 기타 지적재산권은 회사의 소유입니다. 회사는 서비스와 관련하여 회원에게 회사가 정한 이용조건에 따라 서비스를 이용할 수 있는 이용권한만을 부여하며, 회원은 이를 유상양도, 판매, 담보제공 등의 처분행위를 할 수 없습니다.
 2. 회원은 회사가 제공하는 서비스를 이용함으로써 얻은 정보 중 회사 또는 제공업체에 지적재산권이 귀속된 정보를 회사 또는 제공업체의 사전 승낙 없이 복제, 전송, 출판, 배포, 방송 기타 방법에 의하여 영리목적으로 이용하거나 제3자에게 이용하게 하여서는 안됩니다.

제18조 (정보의 수집 등)
 1. 회사는 서비스의 운영, 프로그램 안정화 및 오류개선, 악성코드 감염여부 확인 등 서비스 품질개선을 위해 회원들의 개인정보를 제외한 PC 및 단말기 설정 및 사양정보와 시스템 정보, 오류 정보를 수집 • 활용할 수 있습니다.
 2. 회사는 회원에게 안정적이고 신속하게 서비스를 제공하기 위하여, 서비스 설치 및 이용 시에 회원 PC 및 단말기의 일부 저장공간이나 리소스를 활용하여 다른 회원에게 데이터를 전송하는 Grid Computing, 분산처리시스템 과 같은 기술을 적용할 수 있습니다.

제5장 계약의 해제 • 해지 및 이용제한

제19조 (회원의 해지)
 1. 회원은 언제든지 회사의 어플리케이션(한파킹) 및 웹사이트(hmkpk.kr)을 통하여 서비스 이용계약 해지 신청(회원탈퇴)을 할 수 있습니다. 회원이 회원탈퇴를 신청한 경우 회사는 회원 본인 여부를 확인할 수 있으며, 관계 법령 등이 정하는 바에 따라 이를 즉시 처리합니다.
 2. 회원이 서비스 이용계약을 해지할 경우, 관계 법령 및 개인정보처리방침에 따라 회사가 회원정보를 보유하는 경우를 제외하고는 해지 즉시 회원의 모든 데이터는 소멸됩니다.

제20조 (회사의 해지)
 1. 회사는 회원이 이 약관을 위반한 경우 또는 다음 각 호의 어느 하나에 해당하는 경우에는 회원에 대하여 10일 이내의 기간을 정하여 시정할 것을 최고하고, 그 기간 동안 시정되지 않을 경우 서비스 이용계약을 해지할 수 있습니다. 다만, 회원이 현행법 위반 및 고의 또는 중대한 과실로 회사에 손해를 입힌 경우에는 사전통보 없이 서비스 이용계약을 해지할 수 있습니다. 
  가. 회원이 제공한 데이터가 허위임이 판명된 경우
  나. 범죄적 행위에 관련되는 경우
  다. 국익 또는 사회적 공익을 저해할 목적으로 서비스 이용을 계획 또는 실행할 경우
  라. 타인의 서비스 아이디 및 비밀번호를 도용한 경우
  마. 타인의 명예를 손상시키거나 불이익을 주는 경우
  바. 같은 사용자가 다른 아이디로 이중 등록을 한 경우
  사. 서비스에 위해를 가하는 등 서비스의 건전한 이용을 저해하는 경우 
  아. 기타 관련 법령이나 회사가 정한 이용조건에 위배되는 경우
 2. 회사가 서비스 이용계약을 해지하는 경우 회사는 회원에게 서면, 문자 메시지, 전화 또는 이에 준하는 방법으로 다음 각 호의 사항을 회원에게 통보합니다. 
  가. 해지사유
  나. 해지일

제21조 (회원에 대한 서비스 이용제한 등)
 1. 회원이 이 약관의 내용에 위배되는 행동을 한 경우, 회사는 임의로 서비스 이용을 제한 또는 중지할 수 있습니다. 이 경우 회사는 회원의 접속을 금지할 수 있으며, 회원이 게시한 내용의 전부 또는 일부를 임의로 삭제할 수 있습니다.
 2. 1년 이상 휴면 회원인 경우, 안내 메일 또는 공지사항 발표 후 1주일 간의 통지 기간을 거쳐 서비스 이용을 중지할 수 있습니다.
 3. 회원이 제공하는 정보의 내용이 허위인 것으로 판명되거나 허위가 있다고 의심할 만한 합리적인 사유가 발생한 경우, 회사는 회원의 서비스 이용을 전부 또는 일부 이용 정지할 수 있으며, 이로 인해 발생하는 불이익에 대해 책임을 지지 않습니다.

제22조 (양도금지)
  회원은 이 약관에 의한 서비스의 이용권한, 회원 간 서비스 계약 등 기타 서비스 이용계약 상의 권리, 지위 등을 타인에게 양도 및 증여할 수 없으며, 이를 담보로 제공할 수 없습니다. 

제6장 손해배상 및 회사의 책임 제한 등

제23조 (손해배상)
 1. 회사가 고의 또는 중과실로 회원에게 손해를 끼친 경우, 회사는 회원에게 그 손해에 대하여 배상할 책임이 있습니다.
 2. 회원이 이 약관을 위반하여 회사에 손해를 끼친 경우, 회원은 회사에게 그 손해에 대하여 배상할 책임이 있습니다.

제24조 (회사의 책임제한)
 1. 회사는 전시, 사변, 천재지변, 비상사태, 현재의 기술로는 해결이 불가능한 기술적 결함 또는 이에 준하는 불가항력으로 인하여 서비스를 제공할 수 없는 경우에는 서비스 제공에 관한 책임이 면제됩니다.
 2. 회사는 회원의 귀책사유로 인한 서비스 이용의 중지, 이용장애 및 계약 해지에 대하여는 책임을 지지 않습니다.
 3. 회원 또는 회사의 이용계약 해지 등으로 인하여 회원과 회사의 서비스 이용계약이 종료되는 경우, 관계법령 및 개인정보처리방침에 따라 회사가 회원정보를 보유하는 경우를 제외하고는 회사는 보다 나은 서비스 환경 등을 위하여 해지 즉시 회원의 계정정보 및 관련된 모든 데이터를 삭제할 수 있으며 회사는 서비스 이용계약 종료 이후 회원의 계정정보 및 관련 데이터 삭제로 인한 책임을 부담하지 않습니다.
 4. 회사는 기간통신 사업자가 전기통신서비스를 중지하거나 정상적으로 제공하지 아니하여 회원에게 손해가 발생한 경우에 대해서 회사의 고의 또는 중대한 과실이 없는 한 책임이 면제됩니다.
 5. 회사는 사전에 공지된 서비스용 설비의 보수, 교체, 정기점검, 공사 등 부득이한 사유로 서비스가 중지되거나 장애가 발생한 경우에 대해서 회사의 고의 또는 중대한 과실이 없는 한 책임이 면제됩니다.
 6. 회사는 회원의 PC 및 단말기 환경으로 인하여 발생하는 제반 문제 또는 회사의 고의 또는 중대한 과실이 없는 네트워크 환경으로 인하여 발생하는 문제에 대해서 책임이 면제됩니다.
 7. 회사는 회원 또는 제3자가 서비스와 관련하여 게재한 정보, 자료, 사실의 신뢰도, 정확성 등의 내용에 관하여는 회사의 고의 또는 중대한 과실이 없는 한 책임을 지지 않습니다.
 8. 회사는 회원 간 또는 회원과 제3자 상호간에 서비스를 매개로 하여 거래 등을 한 경우에는 개입할 의무가 없으며, 이로 인한 손해를 배상할 책임도 없습니다.
 9. 회사는 무료로 제공하는 서비스의 이용과 관련하여 회원이 입은 손해에 대하여, 회사의 고의 또는 중과실로 야기되지 않는 한, 책임을 지지 않습니다.
 10. 회사는 회원의 PC 및 단말기 오류에 의한 손해가 발생한 경우 또는 신상정보 및 연락처를 부정확하게 기재하거나 미기재하여 손해가 발생한 경우에 대하여 회사의 고의 또는 중대한 과실이 없는 한 책임이 면제됩니다.
 11. 관련 법령, 정부 정책 등에 따라 서비스 제공을 할 수 없는 경우에는 책임이 면제됩니다. 
 12. 회원의 불법적인 행위 또는 이 약관에 위배되는 행위로 인하여 회사에 손해가 발생하거나 수사기관, 행정청으로부터 형사처벌 또는 제재를 받은 경우 회원은 회원의 비용(손해배상금, 소송비용, 변호사 비용 등을 포함하되 이에 한정하지 아니함)으로 손해를 정보하고 회사를 면책하여야 합니다. 

제25조 (회사의 고충처리 및 분쟁해결)
 1. 회사는 회원의 편의를 고려하여 회원의 의견이나 불만을 제시하는 방법을 회사의 어플리케이션(한파킹) 및 웹사이트(hmkpk.kr)에서 안내합니다. 회사는 이러한 회원의 의견이나 불만을 처리하기 위한 전담조직을 운영할 수 있습니다.
 2. 회사는 회원으로부터 제기되는 의견이나 불만이 정당하다고 객관적으로 인정될 경우에는 합리적인 기간 내에 이를 신속하게 처리합니다. 다만, 처리에 장기간이 소요되는 경우에는 회원에게 장기간이 소요되는 사유와 처리일정을 회사의 어플리케이션(한파킹) 및 웹사이트(hmkpk.kr)에 공지하거나 전화, 문자 메시지 또는 서면 등으로 통보합니다.
 3. 회사와 회원간에 분쟁이 발생하여 제3의 분쟁조정기관이 조정할 경우 회사는 이용 제한 등 회원에게 조치한 사항을 성실히 증명하고, 조정기관의 조정에 따를 수 있습니다.

제26조 (회원에 대한 통지)
 1. 회사는 회원에게 통지를 하는 경우 이 약관에 별도 규정이 없는 한 전화, 문자 메시지 등으로 할 수 있습니다.
 2. 회사는 회원 전체에게 통지를 하는 경우, 7일 이상 회사의 어플리케이션(한파킹) 및 웹사이트(hmkpk.kr)에 게시하거나 연결화면, 팝업화면 등을 통해 제시함으로써 제1항의 통지에 갈음할 수 있습니다.

제27조 (준거법 및 재판관할)
 1. 회사와 회원 간의 제기된 소송은 대한민국법을 준거법으로 합니다.
 2. 회사와 회원 간 발생한 분쟁에 관한 소송은, 제소 당시 회원의 주소에 의하고, 주소가 없는 경우 거소를 관할하는 지방법원의 전속관할로 합니다. 단, 제소 당시 회원의 주소 또는 거소가 명확하지 아니한 경우의 관할법원은 민사소송법에 따라 정합니다.




<부칙> 이 약관은 2024년 4월 1일부터 시행됩니다.`}
        </pre>
    );
}

export default Terms;